app/views/shared/_image.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1  [["id", 4]]
---
<img src="<%= transaction.group.icon %>" alt="" class="">