app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Electronics"], ["user_id", 1], ["created_at", "2021-04-28 17:05:35.254558"], ["updated_at", "2021-04-28 17:05:35.254558"]]
---
  def create
    @group = current_user.groups.build(group_params)
    if @group.save

SELECT "groups".* FROM "groups" ORDER BY name
---
  def index
    @groups = Group.all.order('name')

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 1]]
---
  def show
    @group = Group.find_by(id: params[:id])
    @transactions = Transaction.in_u_g.where(group_id: @group.id).dsc