app/controllers/transactions_controller.rb

SELECT "groups".* FROM "groups"
---
    def new
      @transaction = Transaction.new
      @groups = Group.all.collect { |group| [group.name, group.id] }

INSERT INTO "transactions" ("name", "description", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Perfumes"], ["description", "Women perfumes"], ["amount", 30.0], ["user_id", 6], ["created_at", "2021-04-19 10:25:43.760451"], ["updated_at", "2021-04-19 10:25:43.760451"]]
---
    def create
      @transaction = current_user.transactions.build(transaction_params)
      if @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @transaction = Transaction.find_by(id: params[:id])

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 6]]
---
    def index
      @transactions = Transaction.in_u_g.where(user_id: current_user.id).dsc

SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" IS NULL AND "transactions"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 6]]
---
    def no_grp
      @transactions = Transaction.in_u_g.where({ group_id: nil, user_id: current_user.id }).dsc