app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Emma"], ["created_at", "2021-04-17 18:44:23.214320"], ["updated_at", "2021-04-17 18:44:23.214320"]]