app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def login
      @user = User.find_by(name: params[:session][:name])