app/views/transactions/new.html.erb


  <%= collection_select(:transaction, :group_id, Group.all, :id, :name, { :prompt => 'Group' }, class: "form-control" ) %>
---
SELECT "groups".* FROM "groups"