app/views/transactions/show.html.erb

    <div class="mt-2 mb-4 d-flex">
      <% if @transaction.group %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]